Open_Foam/Simulation_Src/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    free_surface
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    flat_plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       20000;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       20100;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
